network_basics/paperwork/computer-networks.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Computer Networks Course Syllabus</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Computer Networks Course Syllabus"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-18T20:37+0800"/>
<meta name="author" content="HU Kunrong"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Computer Networks Course Syllabus</h1>

<ul>
<li>Course ID: A05055
</li>
<li>Hours: 48 (lecture: 32; lab: 16)
</li>
<li>Credits: 2.5
</li>
<li>Practice: 1 week
</li>
<li>Applicable: 
<ul>
<li>Information Engineering
</li>
<li>Electronics and Information Engineering
</li>
<li>Electronic Science and Technology
</li>
<li>Computer Science and Technology 
</li>
</ul>

</li>
</ul>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Course nature and pre-requisites</a></li>
<li><a href="#sec-2">Chapters</a></li>
<li><a href="#sec-3">Time Arrangement</a></li>
<li><a href="#sec-4">Lab tutorial</a></li>
<li><a href="#sec-5">Practical</a></li>
<li><a href="#sec-6">Grading</a></li>
<li><a href="#sec-7">Textbook and references</a></li>
<li><a href="#sec-8">Focals</a></li>
<li><a href="#sec-9">Requirements on assignments, lab work and practice</a></li>
<li><a href="#sec-10">Relations with other courses</a></li>
<li><a href="#sec-11">Special Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Course nature and pre-requisites</h3>
<div class="outline-text-3" id="text-1">

<p>   This course introduces students comprehensive concepts of computer
   networking. Upon finishing this course, students should have clear
   understanding about
</p><ul>
<li>Basic Concepts of Data Communication
</li>
<li>Network Infrastructure
</li>
<li>ISO/OSI RM
</li>
<li>TCP/IP Protocol Suite
</li>
<li>Network management
</li>
<li>Network Security
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Chapters</h3>
<div class="outline-text-3" id="text-2">

<ol>
<li>Introduction to Networks
<ul>
<li>History and Evolution of Computer Networks
</li>
<li>The Definition of Computer Networks
</li>
<li>The Classification of Computer Networks
</li>
<li>Network Topologies
</li>
<li>Typical Computer Networks
</li>
<li>Data Communication Services
</li>
<li>The Application of Computer Networks
</li>
</ul>

</li>
<li>Physical Layer
<ul>
<li>Basic concepts in Physical Layer
</li>
<li>Basic concepts in Data Communication
</li>
<li>Transmission media
</li>
<li>Multiplexing
</li>
<li>Data Transmission Systems
</li>
<li>Broadband Access Technology
</li>
</ul>

</li>
<li>Data Link Layer
<ul>
<li>PPP Based Data Link Layer
</li>
<li>PPP Protocol
</li>
<li>Broadcast Based Data Link Layer
</li>
<li>Broadcast Based Ethernet
</li>
<li>Extended Ethernet
</li>
<li>Fast Ethernet
</li>
<li>Other LAN Techniques
</li>
</ul>

</li>
<li>Network Layer
<ul>
<li>The two services provided in Network Layer
</li>
<li>Internet Protocol
</li>
<li>Subnet and Supernet
</li>
<li>ICMP
</li>
<li>Routing Protocols
</li>
<li>IP Multicasting
</li>
<li>VPN and NAT
</li>
</ul>

</li>
<li>Transmission Layer
<ul>
<li>Transmission Layer Protocols
</li>
<li>UDP
</li>
<li>TCP
</li>
<li>How TCP works
</li>
<li>TCP header
</li>
<li>Implementation of TCP transmission
</li>
<li>TCP Flow Control
</li>
<li>TCP Congestion Control
</li>
<li>TCP Connection Management
</li>
</ul>

</li>
<li>Application Layer
<ul>
<li>DNS
</li>
<li>FTP
</li>
<li>TELNET
</li>
<li>WWW
</li>
<li>EMail
</li>
<li>DHCP
</li>
<li>SNMP 
</li>
<li>Process Communication over Networks
</li>
</ul>

</li>
<li>Network Security and Management
<ul>
<li>The Importancy of Network Security
</li>
<li>Network Security Stratagy Design
</li>
<li>Detecting Security Problem
</li>
<li>Firewalling
</li>
<li>Backup/Restore
</li>
<li>Anti-Viruses
</li>
<li>Network Management
</li>
</ul>

</li>
<li>Audio/Video Services Over Internet
<ul>
<li>Concepts
</li>
<li>Streaming
</li>
<li>Interactive Audio/Video
</li>
<li>Improve "Best Effort" Service
</li>
</ul>

</li>
<li>Wireless Networks
<ul>
<li>WLAN
</li>
<li>WPAN
</li>
<li>WMAN
</li>
</ul>

</li>
<li>Next Generation Internet
<ul>
<li>IPv6 (IPng)
</li>
<li>MPLS
</li>
<li>P2P File Sharing
</li>
</ul>

</li>
</ol>

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">Time Arrangement</h3>
<div class="outline-text-3" id="text-3">

<ol>
<li>Introduction: 2 hrs
</li>
<li>Phy Layer: 6 hrs (lectures: 4, lab: 2)
</li>
<li>Data Link Layer: 8 hrs (lectures: 6, lab: 2)
</li>
<li>Network Layer: 12 hrs (lectures: 8, lab: 4)
</li>
<li>Transport Layer: 10 hrs (lectures: 6, lab: 4)
</li>
<li>App Layer: 6 hrs (lectures: 4, lab: 2)
</li>
<li>Network Security 4 hrs (lectures: 2, lab: 2)
</li>
</ol>

</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">Lab tutorial</h3>
<div class="outline-text-3" id="text-4">

<ol>
<li>Data transmission media, 2 hrs
</li>
<li>Data link layer device configuration, 2 hrs
</li>
<li>Network layer device configuration, 4 hrs
</li>
<li>Transport layer device configuration, 4 hrs
</li>
<li>Application layer protocols, 2 hrs
</li>
<li>Network security, 2 hrs
</li>
</ol>

</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">Practical</h3>
<div class="outline-text-3" id="text-5">

<p>   1 week campus network based network construction and configuration work, focus on
   network layer and application layer.
</p></div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6">Grading</h3>
<div class="outline-text-3" id="text-6">

<ul>
<li>Examination: 50% (Closed book, written)
</li>
<li>Homework: 20%
</li>
<li>Lab: 20%
</li>
<li>Class: 10%
</li>
</ul>

</div>

</div>

<div id="outline-container-7" class="outline-3">
<h3 id="sec-7">Textbook and references</h3>
<div class="outline-text-3" id="text-7">

<ul>
<li><i>Computer Networks</i>, Xie Xiren, Electronics Engineering Press.
</li>
<li><i>Computer Networks</i>, Andrew S.Tanenbaum, Tsinghua Unversity Press.
</li>
<li><i>Computer Networks Lab Tutorials</i>, Xie Qian, Electronics Engineering Press.
</li>
<li><i>Computer Network Tutorials</i>, Du Yu, People's Post and
     Telecommunication Press, 1st edition Jan 2002.
</li>
<li><i>Computer Network Practical Tutorials</i>, Wang Li, Zhang Yuxiang,
     Yang Lianghuai, Tsinghua University Press, 1st edition Dec 1999.
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-3">
<h3 id="sec-8">Focals</h3>
<div class="outline-text-3" id="text-8">

<ul>
<li>Network Infrastructure
</li>
<li>ISO/OSI RM
</li>
<li>TCP/IP Protocol Suite
</li>
<li>Network management
</li>
<li>Network Security
</li>
</ul>

</div>

</div>

<div id="outline-container-9" class="outline-3">
<h3 id="sec-9">Requirements on assignments, lab work and practice</h3>
<div class="outline-text-3" id="text-9">

<p>   There will be weekly homework assignments. The assignments are due at the beginning of
   the class on the day specified on the assignment. In general, no extensions will be
   granted.
</p>
</div>

</div>

<div id="outline-container-10" class="outline-3">
<h3 id="sec-10">Relations with other courses</h3>
<div class="outline-text-3" id="text-10">

<ul>
<li>Pre-course: Basic computer skills
</li>
<li>Post-course: Network Construction and Management, Network Programming, Network Security
</li>
</ul>

</div>

</div>

<div id="outline-container-11" class="outline-3">
<h3 id="sec-11">Special Notes</h3>
<div class="outline-text-3" id="text-11">

<p>   None.
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: HU Kunrong (<a href="mailto:hukunrong@gmail.com">hukunrong@gmail.com</a>)</p>
<p class="date">Date: 2014-09-18T20:37+0800</p>

</div>
</body>
</html>
