network_basics/paperwork/computer-networks.tex
% Created 2014-09-18 Thu 20:37
\documentclass{wx672article}

\usepackage{wx672ctex, wx672bib}

\title{Computer Networks Course Syllabus}
\author{WANG Xiaolin}
\date{March 6, 2015}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\begin{itemize}
\item Course ID: A05055
\item Hours: 48 (lecture: 32; lab: 16)
\item Credits: 2.5
\item Practice: 1 week
\item Applicable:
\begin{itemize}
\item Information Engineering
\item Electronics and Information Engineering
\item Electronic Science and Technology
\item Computer Science and Technology
\end{itemize}
\end{itemize}


\section*{Course nature and pre-requisites}
\label{sec-1}

   This course introduces students comprehensive concepts of computer
   networking. Upon finishing this course, students should have clear
   understanding about
\begin{itemize}
\item Basic Concepts of Data Communication
\item Network Infrastructure
\item ISO/OSI RM
\item TCP/IP Protocol Suite
\item Network management
\item Network Security
\end{itemize}
\section*{Chapters}
\label{sec-2}

\begin{enumerate}
\item Introduction to Networks
\begin{itemize}
\item History and Evolution of Computer Networks
\item The Definition of Computer Networks
\item The Classification of Computer Networks
\item Network Topologies
\item Typical Computer Networks
\item Data Communication Services
\item The Application of Computer Networks
\end{itemize}
\item Physical Layer
\begin{itemize}
\item Basic concepts in Physical Layer
\item Basic concepts in Data Communication
\item Transmission media
\item Multiplexing
\item Data Transmission Systems
\item Broadband Access Technology
\end{itemize}
\item Data Link Layer
\begin{itemize}
\item PPP Based Data Link Layer
\item PPP Protocol
\item Broadcast Based Data Link Layer
\item Broadcast Based Ethernet
\item Extended Ethernet
\item Fast Ethernet
\item Other LAN Techniques
\end{itemize}
\item Network Layer
\begin{itemize}
\item The two services provided in Network Layer
\item Internet Protocol
\item Subnet and Supernet
\item ICMP
\item Routing Protocols
\item IP Multicasting
\item VPN and NAT
\end{itemize}
\item Transmission Layer
\begin{itemize}
\item Transmission Layer Protocols
\item UDP
\item TCP
\item How TCP works
\item TCP header
\item Implementation of TCP transmission
\item TCP Flow Control
\item TCP Congestion Control
\item TCP Connection Management
\end{itemize}
\item Application Layer
\begin{itemize}
\item DNS
\item FTP
\item TELNET
\item WWW
\item EMail
\item DHCP
\item SNMP
\item Process Communication over Networks
\end{itemize}
\item Network Security and Management
\begin{itemize}
\item The Importancy of Network Security
\item Network Security Stratagy Design
\item Detecting Security Problem
\item Firewalling
\item Backup/Restore
\item Anti-Viruses
\item Network Management
\end{itemize}
\item Audio/Video Services Over Internet
\begin{itemize}
\item Concepts
\item Streaming
\item Interactive Audio/Video
\item Improve ``Best Effort'' Service
\end{itemize}
\item Wireless Networks
\begin{itemize}
\item WLAN
\item WPAN
\item WMAN
\end{itemize}
\item Next Generation Internet
\begin{itemize}
\item IPv6 (IPng)
\item MPLS
\item P2P File Sharing
\end{itemize}
\end{enumerate}
\section*{Time Arrangement}
\label{sec-3}

\begin{enumerate}
\item Introduction: 2 hrs
\item Phy Layer: 6 hrs (lectures: 4, lab: 2)
\item Data Link Layer: 8 hrs (lectures: 6, lab: 2)
\item Network Layer: 12 hrs (lectures: 8, lab: 4)
\item Transport Layer: 10 hrs (lectures: 6, lab: 4)
\item App Layer: 6 hrs (lectures: 4, lab: 2)
\item Network Security 4 hrs (lectures: 2, lab: 2)
\end{enumerate}
\section*{Lab tutorial}
\label{sec-4}

\begin{enumerate}
\item Data transmission media, 2 hrs
\item Data link layer device configuration, 2 hrs
\item Network layer device configuration, 4 hrs
\item Transport layer device configuration, 4 hrs
\item Application layer protocols, 2 hrs
\item Network security, 2 hrs
\end{enumerate}
\section*{Practical}
\label{sec-5}

   1 week campus network based network construction and configuration work, focus on
   network layer and application layer.
\section*{Grading}
\label{sec-6}

\begin{itemize}
\item Examination: 50\% (Closed book, written)
\item Homework: 20\%
\item Lab: 20\%
\item Class: 10\%
\end{itemize}
\section*{Textbook and references}
\label{sec-7}

\begin{itemize}
\item \emph{Computer Networks}, Xie Xiren, Electronics Engineering Press.
\item \emph{Computer Networks}, Andrew S.Tanenbaum, Tsinghua Unversity Press.
\item \emph{Computer Networks Lab Tutorials}, Xie Qian, Electronics Engineering Press.
\item \emph{Computer Network Tutorials}, Du Yu, People's Post and
     Telecommunication Press, 1st edition Jan 2002.
\item \emph{Computer Network Practical Tutorials}, Wang Li, Zhang Yuxiang,
     Yang Lianghuai, Tsinghua University Press, 1st edition Dec 1999.
\end{itemize}
\section*{Focals}
\label{sec-8}

\begin{itemize}
\item Network Infrastructure
\item ISO/OSI RM
\item TCP/IP Protocol Suite
\item Network management
\item Network Security
\end{itemize}
\section*{Requirements on assignments, lab work and practice}
\label{sec-9}

   There will be weekly homework assignments. The assignments are due at the beginning of
   the class on the day specified on the assignment. In general, no extensions will be
   granted.
   
\section*{Relations with other courses}
\label{sec-10}

\begin{itemize}
\item Pre-course: Basic computer skills
\item Post-course: Network Construction and Management, Network Programming, Network Security
\end{itemize}
\section*{Special Notes}
\label{sec-11}

   None.
   

\end{document}
